In [40]:
import pandas as pd
from collections import OrderedDict

In [41]:
friend_list1 = [
    ['name', ['A','B','C']],
    ['age', [20, 30, 40]],
    ['job', ['student','teacher','developer']]
]

friend_list2 = [
    ['A', 20, 'student'],
    ['B', 30, 'developer'],
    ['C', 40, 'teacher']
]

friend_dict_list = [
    {'name' : 'A', 'age' : 20, 'job' : 'student'},
    {'name' : 'B', 'age' : 30, 'job' : 'developer'},
    {'name' : 'C', 'age' : 40, 'job' : 'teacher'}
]

friend_ordered_list = OrderedDict(
    [
        ('name', ['A', 'B', 'C']),
        ('age', [20, 30, 40]),
        ('job', ['student', 'teacher', 'developer'])
    ]
)


type(friend_dict_list)

list

In [42]:
df = pd.DataFrame(friend_dict_list)
df.head()

  name  age        job
0    A   20    student
1    B   30  developer
2    C   40    teacher

In [43]:
df = df[['name', 'age', 'job']]

In [44]:
df.head()

  name  age        job
0    A   20    student
1    B   30  developer
2    C   40    teacher

In [45]:
df = pd.DataFrame.from_dict(friend_ordered_list)

In [46]:
df.head()

  name  age        job
0    A   20    student
1    B   30    teacher
2    C   40  developer

In [47]:
column_name = ['name','age','job']
df = pd.DataFrame.from_records(friend_list2, columns=column_name)

In [49]:
df.head()

  name  age        job
0    A   20    student
1    B   30  developer
2    C   40    teacher

In [50]:
df[df.age>25]

  name  age        job
1    B   30  developer
2    C   40    teacher

In [52]:
df.query('age>25')

  name  age        job
1    B   30  developer
2    C   40    teacher

In [54]:
df[(df.age>25)&(df.name=="C")]

  name  age      job
2    C   40  teacher

In [58]:
df = pd.DataFrame.from_records(friend_list2)
df

   0   1          2
0  A  20    student
1  B  30  developer
2  C  40    teacher

In [59]:
df.iloc[:,0:2]

   0   1
0  A  20
1  B  30
2  C  40

In [60]:
df.iloc[0:2, 0:2]

   0   1
0  A  20
1  B  30

In [74]:
df =  pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [75]:
df_filtered = df[['name','age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [76]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [77]:
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [79]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25